# DeleteAllComponents

## Description
Deletes all components in an object.

```pascal
FUNCTION DeleteAllComponents(object : HANDLE) : BOOLEAN;
```

```python

def vs.DeleteAllComponents(object):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a wall, round wall, Wall Style, or the Wall Preferences.|

## Version
Availability: from VectorWorks12.5
## Category
* Objects - Architectural